test_cases/naca0012_Ma-0.80_Re-10_alpha-1_SA_base_Set4/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          1.0e-6;

writeControl    adjustable;

writeInterval   0.005;

purgeWrite      0;

writeFormat     binary;

writePrecision   8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           2.0;

maxDeltaT       1e-4;

functions
{
    #include "FOMachNo"
    #include "FOyPlus"
    #include "FOforces"
    #include "FOpressure"
    #include "FOsurfaceSample"
    #includeFunc solverInfo
}

// ************************************************************************* //
